{
  "projets" : [{
    "title": "Statcraft",
    "title_color": "white",
    "description_short" : "Statcraft est une application interne de l'Insee qui collecte, exploite et diffuse les statistiques de consultation du site insee.fr.",
    "description_long" : "Statcraft est une application interne de l'Insee qui collecte, exploite et diffuse les statistiques de consultation du site insee.fr. <br> <br> Il s'agit d'un système d'information complet dont le point de départ est la lecture et l'analyse en R des logs journalières générées par les serveurs Apache. Un <i>backoffice</i> en Rshiny permet de lancer des batchs sur les dernières logs et de choisir les traitements à appliquer. <br><br>Les batchs permettent de séparer les différents éléments sémantiques des lignes de log pour les ventiler dans les catégories correspondantes et recourent à plusieurs API spécialisées dans l'analyse des adresses ip et des <i>user-agent</i>. <br><br>Les données sont ensuite agrégées sur différentes échelles de temps et différentes variables (type de page, type de public etc.) puis insérées dans une base de données PostgreSQL. <br><br> Enfin, une application web ouverte à tous les agents de l'Insee permet d'afficher sous forme d'indicateurs synthétiques ou de graphiques ces données et de les exporter.",
    "prev": false,
    "prev_text": "",
    "date": "2020-2022",
    "stack": ["R", "Rshiny","Javascript","Sass","PostgreSQL", "Bash", "Highcharts"],
    "github": false,
    "visible": true,
    "highlight":true,
    "illustrations": ["frame_1.jpg", "frame_2.jpg", "frame_3.jpg", "frame_4.jpg", "frame_5.jpg", "frame_6.jpg", "frame_7.jpg", "frame_8.jpg"]
  },
  {
    "title": "Frustration",
    "title_color": "white",
    "description_short" : "Site web du magazine de critique sociale Frustration.",
    "description_long" : "<span style='font-variant: all-small-caps'> FRUSTRATION </span> est un média en ligne qui après avoir débuté avec un format hybride papier/numérique s'est ensuite tourné vers une formule 100% numérique. <br> <br> Pour accompagner cette transition, j'ai repensé l'interface du site en appliquant une charte graphique cohérente, plus forte et capable de distinguer visuellement ce média de ses concurrents. <br> <br> Parmi les chantiers achevés ou en cours pour accroître l'audience : <ul style='list-style-type:disc; padding:0 0 0 5%'> <br> <li> Mise en place d'une newsletter bimensuelle (MailPoet) ; </li> <br> <li> Redéfinition responsive des jeux de police et de l'ergonomie générale des pages pour améliorer le confort de lecture ; </li> <br> <li> Amélioration de la page d'abonnement et transition vers une formule de paiement maison pour augmenter le taux de conversion visite/abonnement ;</li> <br> <li> Mise en place de quiz interactifs pour proposer des formats plus ludiques et accélérer la viralité du site.</li></ul>",
    "prev": "https://www.frustrationmagazine.fr/",
    "prev_text": "Voir le site",
    "date":"2021-2022",
    "stack": ["Wordpress", "Highcharts"],
    "github": "",
    "visible": true,
    "highlight":true,
    "illustrations": ["frame_1.jpg", "frame_2.jpg", "frame_3.jpg", "frame_4.jpg", "frame_5.jpg"]
  },

    {
      "title": "Groupomania",
      "title_color": "white",
      "description_short": "Réseau social d'entreprise pour poster des messages et des memes.",
      "description_long": "Un réseau social d'entreprise pour poster des messages et des memes.",
      "prev": "https://thibautizard.github.io/login",
      "prev_text": "Voir l'application",
      "date":"2021",
      "stack": ["React", "Redux", "Node", "MaterialUI", "Sass"],
      "github": "https://github.com/thibautizard/book_groupomania",
      "visible": true,
      "highlight":false,
      "illustrations": ["frame_1.jpg", "frame_2.jpg", "frame_3.jpg", "frame_4.jpg", "frame_5.jpg"]
    },

  {
    "title": "Sisam",
    "title_color": "white",
    "description_short": "Sisam est une application qui permet de visualiser et modifier l'allocation des bureaux à l'Insee.",
    "description_long": "Ce prototype d'application React visait à répondre à certains besoin RH exprimés par l'Insee pour recouper plusieurs bases d'informations relatives aux bureaux disponibles sur le site de Montrouge et leurs modalités d'occupation (suivi des effectifs, répartition du matériel informatique, présence ou absence d'équipements de sécurité etc.) qui étaient jusqu'à aujourd'hui séparées les unes des autres avec des rythmes d'actualisation différents <br><br> Après conversion des fichiers excel existant dans une base de données locale SQLite, l'application offrait la possibilité d'opérer des jointures entre ces différents niveaux d'information, de surveiller les taux d'occupation pour chaque direction et de proposer l'attribution d'un bureau disponible en agent en fonction de son grade et de ses besoins spécifiques (handicap, matériel de travail etc.). <br> <br> Les informations relatives aux agents pouvaient être modifiées à travers différents formulaires qui prévoyaient des contrôles sur leurs différents champs et bloquaient l'attribution d'un bureau non disponible pour limiter les erreurs de saisie courantes dans le système précédent. Toute modification était ensuite répercutée sur les tables concernées afin d'éviter les retraitements manuels auxquels contraignait le système de fichiers antérieur. <br> <br> Un module de gestion des mobilités avait été également mis à l'étude pour anticiper les mouvements de fin des campagnes de mobilité.",
    "prev": "https://thibautizard.github.io/book_reservia/",
    "prev_text": "Voir l'application",
    "date":"2020",
    "stack": ["React", "Sass", "SQLite", "Node"],
    "github": "https://thibautizard.github.io/book_reservia/",
    "visible": true,
    "highlight":false,
    "illustrations": ["frame_1.jpg", "frame_2.jpg", "frame_3.jpg", "frame_4.jpg", "frame_5.jpg", "frame_6.jpg", "frame_7.jpg", "frame_8.jpg"]
  },

    {
      "title": "Reservia",
      "title_color": "white",
      "description_short": "Site de réservations d'hôtels et d'activités.",
      "description_long": "Projet personnel d'une maquette HTML et CSS d'un site de réservations d'hôtels et d'activités.",
      "prev": "https://thibautizard.github.io/book_reservia/",
      "prev_text": "Voir le site",
      "github":"https://thibautizard.github.io/book_reservia/",
      "date":"2020",
      "stack": ["HTML", "CSS"],
      "visible": true,
      "highlight":false,
      "illustrations": ["frame_1.jpg", "frame_2.jpg"]

    }

  ]
}
